Revit 2027 API
FailuresAccessor.JournalFailures Method
 Allows to record information about failures in the journal.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void JournalFailures(
	IList<FailureMessageAccessor> failures
)
Public Sub JournalFailures (
	failures As IList(Of FailureMessageAccessor)
)
public:
void JournalFailures(
	IList<FailureMessageAccessor^>^ failures
)
member JournalFailures :
        failures : IList<FailureMessageAccessor> -> unit
Parameters
failures IList<FailureMessageAccessor>
 Accessors to the failures to journal.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  This FailuresAccessor is inactive (is used outside of failures processing).
Remarks
 Records information about failure messages and elements involved in the failures. If this method not invoked, journal does not contain any information about failures resolved by (pre)processing.
See Also
Reference
FailuresAccessor Class
Autodesk.Revit.DB Namespace